# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [1]:
# your answer here

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy.stats as stats
import seaborn as sns
import math

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [4]:
# your answer here

employee = pd.read_csv('Employee.csv')

employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [6]:
# Method 1
# your answer here

mean_salary_groupby = employee.groupby('Department')['Salary'].mean()

mean_salary_groupby

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [7]:
# Method 2
# your answer here

mean_salary_pivot = employee.pivot_table(index='Department', values='Salary', aggfunc='mean')

mean_salary_pivot

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

In [8]:
# your answer here

mean_salary_by_department_title = employee.pivot_table(index=['Department', 'Title'], values='Salary', aggfunc='mean')

mean_salary_by_department_title

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [10]:
# your answer here

pivot_years_salary_title = employee.pivot_table(index='Title', values=['Years', 'Salary'], aggfunc='mean')

pivot_years_salary_title

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [11]:
# your answer here

pivot_mean_salary_count = employee.pivot_table(index=['Department', 'Title'], values='Salary', aggfunc=['mean', 'count'])

pivot_mean_salary_count

                       mean  count
                     Salary Salary
Department Title
HR         VP          70.0      1
           analyst     32.5      2
IT         VP          70.0      1
           analyst     32.5      2
           associate   60.0      1
Sales      associate   55.0      2

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [12]:
# your answer here

pivot_salary_stats = employee.pivot_table(index=['Department', 'Title'], values='Salary', aggfunc=['median', 'min', 'max', 'std'])

pivot_salary_stats

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60       NaN
Sales      associate   55.0     55     55  0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [16]:
# your answer here

# HOW TO FILL VALUES UP WITH MEDIAN???

pivot_salary_stats = pivot_salary_stats.fillna(0)

pivot_salary_stats

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60  0.000000
Sales      associate   55.0     55     55  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [14]:
# your answer here

pivot_department_stats = employee.pivot_table(index='Department', values='Salary', aggfunc=['sum', 'count'])

pivot_department_stats.columns = ['Total Salary', 'Number of Employees']

pivot_department_stats

            Total Salary  Number of Employees
Department
HR                   135                    3
IT                   195                    4
Sales                110                    2

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [17]:
# your answer here

pivot_experience_salary = employee.pivot_table(index=['Department', 'Title'], values=['Years', 'Salary'], aggfunc={'Years': 'sum', 'Salary': 'mean'})

pivot_experience_salary

                      Salary  Years
Department Title
HR         VP           70.0      8
           analyst      32.5      6
IT         VP           70.0      8
           analyst      32.5      3
           associate    60.0      7
Sales      associate    55.0      5

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [18]:
# your answer here

# Custom function to compute the mean after removing the maximum value
def mean_without_max(series):
    return series[series != series.max()].mean()

# Create pivot table using the custom function
pivot_mean_without_max = employee.pivot_table(index='Department', values='Salary', aggfunc=mean_without_max)

pivot_mean_without_max

               Salary
Department
HR          32.500000
IT          41.666667